
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Движение = Движения.ЗаказыКлиентов.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.ЗаписьКлиента = Ссылка;
	Движение.СуммаПлан = Услуга.Итог("Стоимость");
	
КонецПроцедуры


//Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
//			Ответственный = ПараметрыСеанса.ТекущийПользователь;
//	
//КонецПроцедуры


Процедура ПроверитьОказаниеУслуг()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровИУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
		|ГДЕ
		|	РеализацияТоваровИУслуг.Проведен
		|	И РеализацияТоваровИУслуг.Основание = &Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровИУслуг.Ссылка";
	
	Запрос.УстановитьПараметр("Основание", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		УслугаОказана = Истина;
	КонецЕсли;
	КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
Если ЗначениеЗаполнено(Ссылка) И УслугаОказана = Ложь Тогда
    ПроверитьОказаниеУслуг();
КонецЕсли;

Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
    Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецЕсли;

ДлительностьУслуг = РассчитатьДатуОкончанияЗаписи();
Если ДлительностьУслуг = 0 Тогда 
    ДлительностьУслуг = 60;
КонецЕсли;
ДатаОкончанияЗаписи = ДатаЗаписи + ДлительностьУслуг *60; 
КонецПроцедуры 


//Процедура ПриЗаписи(Отказ)
//	Если ЗначениеЗаполнено(Ссылка) И УслугаОказана = Ложь Тогда
//    ПроверитьОказаниеУслуг();  
//	КонецЕсли;
//КонецПроцедуры      

Функция РассчитатьДатуОкончанияЗаписи()

ТЧУслуги = Услуга.Выгрузить(,"Услуга");  
Если ТЧУслуги.Количество() = 0 Тогда
        Возврат 0;
    КонецЕсли;

Запрос = Новый Запрос;
Запрос.УстановитьПараметр("ТЧУслуги", ТЧУслуги); 
Запрос.Текст=
"ВЫБРАТЬ
|	ТЧУслуги.Услуга КАК Номенклатура
|ПОМЕСТИТЬ ВТ_Номенклатура
|ИЗ
|	&ТЧУслуги КАК ТЧУслуги
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	СУММА(Ном.ДлительностьУслуги) КАК ДлительностьУслуги
|ИЗ
|	ВТ_Номенклатура КАК ВТ_Номенклатура
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
|		ПО ВТ_Номенклатура.Номенклатура = Ном.Ссылка";

Рез = Запрос.Выполнить();
Если Рез.Пустой() Тогда
    возврат 0;
КонецЕсли;

Выборка = Запрос.Выполнить().Выбрать();
Выборка.Следующий();
возврат Выборка.ДлительностьУслуги;

КонецФункции



