
&НаКлиенте
Процедура ЗаполнениеДанных(Команда)
	ПолучитьДанныеОПродажах();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеОПродажах();
	Запрос = Новый Запрос;
	
Запрос.Текст = "ВЫБРАТЬ
               |	ПродажиОбороты.Сотрудник КАК Сотрудник,
               |	ПродажиОбороты.СуммаОборот КАК СуммаОборот
               |ИЗ
               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Месяц, ) КАК ПродажиОбороты
               |
               |УПОРЯДОЧИТЬ ПО
               |	ПродажиОбороты.Сотрудник.Фамилия"  ;
    
Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ПериодНачисления));      
Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодНачисления));
   ВидРасчета = ПланыВидовРасчета.Начисления.НайтиПоКоду("ППОП");  
   
       Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Объект.Начисления.Очистить();
                                                                                                                                             
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.Начисления.Добавить();
        
        НоваяСтрока.Сотрудник = Выборка.Сотрудник;
        НоваяСтрока.ВидРасчета = ВидРасчета;
        НоваяСтрока.ПоказательРасчета = Выборка.СуммаОборот;
        
    КонецЦикла;
    
  
КонецПроцедуры                 