 
 &НаКлиенте
 Процедура УстановитьВидимость()
	
	СтрокаТипПолучателя = ""; 
	
	Если Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаДенегПодотчетнику") Тогда  
		Элементы.РасчетныйСчет.Видимость = Ложь;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.Получатель.Видимость = Истина;
		СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";
	ИначеЕсли Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВзносНаличнымиВБанк") Тогда 
		Элементы.РасчетныйСчет.Видимость = Истина;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.Получатель.Видимость = Истина;
		СтрокаТипПолучателя = "СправочникСсылка.Банки";
	ИначеЕсли Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ОплатаПоставщику")
		ИЛИ Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВозвратДенегПокупателю") Тогда  
		Элементы.РасчетныйСчет.Видимость = Ложь;
		Элементы.ДоговорКонтрагента.Видимость = Истина;
		Элементы.Получатель.Видимость = Истина;
		СтрокаТипПолучателя = "СправочникСсылка.Контрагенты"; 
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ПередачаВДругуюКассу") Тогда
		Элементы.РасчетныйСчет.Видимость = Ложь;  
		Элементы.ДоговорКонтрагента.Видимость = Ложь; 
		Элементы.Получатель.Видимость = лОЖЬ;
	Иначе
		Элементы.ДоговорКонтрагента.Видимость = Истина;
		Элементы.Получатель.Видимость = Истина;  
		
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТипПолучателя) Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип(СтрокаТипПолучателя));
		
		ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
		Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя;
	КонецЕсли;
	
	Если Элементы.ДоговорКонтрагента.Видимость = Истина
		И СтрокаТипПолучателя = "СправочникСсылка.Контрагенты"
		И ЗначениеЗаполнено(Объект.Получатель) Тогда
		Элементы.ДоговорКонтрагента.Видимость = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Получатель);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Получатель)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Запрос.Текст = "ВЫБРАТЬ
	|    Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
	|    Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|    Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|    Контрагенты.Ссылка = &Получатель";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.ТипКонтрагента)
		И Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда
		возврат Ложь;
	Иначе
		возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)

МассивОчищаемыхРеквизитов = Новый Массив;
Если (Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаДенегПодотчетнику")
    ИЛИ Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВзносНаличнымиВБанк") )
    И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
    МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");

    ТекстВопроса = "При изменении реквизита ""Вид операции"" будут очищены следующие данные:
    | - Договор
    | Продолжить?";

КонецЕсли;

Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда
    Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииВидаОперации", ЭтаФорма, МассивОчищаемыхРеквизитов);
    ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");
Иначе
    ВидОперации =  Объект.ВидОперации;
    УстановитьВидимость();
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииВидаОперации(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Да Тогда
    Для Каждого Реквизит Из ДополнительныеПараметры Цикл
        Объект[Реквизит] = Неопределено;
	КонецЦикла;
	УстановитьВидимость();
	ВидОперации =  Объект.ВидОперации;
Иначе
	Объект.ВидОперации = ВидОперации;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)          
	 Если Не ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Или Получатель = Объект.Получатель Тогда
        Получатель = Объект.Получатель;
        УстановитьВидимость();
        Возврат;
    КонецЕсли;
    
     ТипМеняется = Ложь;
    
    Если ТипЗнч(Получатель) <> ТипЗнч(Объект.Получатель) Тогда
        ТипМеняется = Истина;
    ИначеЕсли ТипЗнч(Получатель) = Тип("СправочникСсылка.Контрагенты") Тогда
          СтараяВидимость = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Получатель);
        НоваяВидимость = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Получатель);
        Если СтараяВидимость <> НоваяВидимость Тогда
            ТипМеняется = Истина;
        КонецЕсли;
    КонецЕсли;
    
    Если ТипМеняется Тогда
     
        ТекстВопроса = "При изменении получателя договор будет очищен. Продолжить?";
        Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииПолучатель", ЭтаФорма, 
            Новый Структура("СтарыйПолучатель,НовыйПолучатель", Получатель, Объект.Получатель));
        ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , "Внимание!");
    Иначе
         Объект.ДоговорКонтрагента = Неопределено;
        Получатель = Объект.Получатель;
        УстановитьВидимость();
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииПолучатель(Результат, ДополнительныеПараметры) Экспорт  
	  Если Результат = КодВозвратаДиалога.Да Тогда
        Объект.ДоговорКонтрагента = Неопределено;
		Получатель = Объект.Получатель;
		
    Иначе
    Объект.Получатель = ДополнительныеПараметры.СтарыйПолучатель;
	Получатель = ДополнительныеПараметры.СтарыйПолучатель;
	КонецЕсли   ;

       
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьРеквизитыФормы()

Получатель = Объект.Получатель;
ВидОперации = Объект.ВидОперации;

Если Объект.Ссылка.Пустая() Тогда
	Объект.ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВозвратДенегПокупателю;  
	  Получатель = Объект.Получатель;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	    Получатель = Объект.Получатель;
 УстановитьВидимость();

КонецПроцедуры 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьРеквизитыФормы(); 
КонецПроцедуры

