
Процедура ПолучитьПодтверждениеРегистрацииКлиентаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	    Для Каждого Задача Из ФормируемыеЗадачи Цикл
        Задача.Наименование    = "Получить согласие клиента " + ПолучитьПредставлениеКлиента() + " на регистрацию";
        Задача.Предмет         = Пользователь;
        Задача.ОписаниеЗадачи  = СформироватьОписаниеЗадачи();  
		КонецЦикла;
	КонецПроцедуры     
	
Функция СформироватьОписаниеЗадачи()
    Телефон = "";
    Если Не Пользователь.Пустая() Тогда
        Телефон = Пользователь.Клиент.КонтактныйТелефон;
    КонецЕсли;

    Описание = "Из мобильного приложения поступила заявка на регистрацию пользователя. Необходимо созвониться с клиентом." + Символы.ПС;
    Описание = Описание + "Пользователь: " + Пользователь.Наименование + Символы.ПС;
    Описание = Описание + "Телефон клиента, указанный при регистрации: " + Телефон + Символы.ПС;
    Описание = Описание + "Также нужно получить согласие на регистрацию и до конца заполнить карточку клиента: "
             + "ФИО, дата рождения, сведения о питомцах и другие данные, которые клиент согласен предоставить.";
    Возврат Описание;
КонецФункции




Процедура ПодтверждениеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
    Результат = РегистрацияПодтверждена;
КонецПроцедуры

Процедура ПометкаНаУдалениеПользователяОбработка(ТочкаМаршрутаБизнесПроцесса)
	    Если Пользователь.Пустая() Тогда
        Возврат;
    КонецЕсли;
    ОбъектПользователь = Пользователь.ПолучитьОбъект();
    ОбъектПользователь.УстановитьПометкуУдаления(Истина);
КонецПроцедуры  

Функция ПолучитьПредставлениеКлиента()
    Если Не Пользователь.Пустая() И Не Пользователь.Клиент.Пустая() Тогда
        Возврат Пользователь.Клиент.Наименование;   
    Иначе
        Возврат Пользователь.Наименование;             
	КонецЕсли;
КонецФункции







