Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.УчетнаяПолитика.Записать();
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период          = Дата;
	Движение.УчетнаяПолитика = УчетнаяПолитика;
	
	СтруктураУчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Если СтруктураУчетнаяПолитика.УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.FEFO и
		УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.ПоСредней Тогда
		Движения.ТоварыНаСкладах.Записывать = Истина;
		Движения.ТоварыНаСкладах.Записать();
		
		Блокировка = Новый БлокировкаДанных;
	    ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	    Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
		|	ТоварыНаСкладахОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментИтогов, СрокГодности <> ДАТАВРЕМЯ(1, 1, 1)) КАК ТоварыНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("МоментИтогов", Новый Граница(МоментВремени()));  
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
		    Движение.Период        = Дата;
	        Движение.Склад         = Выборка.Склад;
	        Движение.Номенклатура  = Выборка.Номенклатура;
	        Движение.Количество    = Выборка.Количество;
	        Движение.Сумма         = Выборка.Сумма;
	        Движение.СрокГодности  = Выборка.СрокГодности; 
		
		Движение = Движения.ТоварыНаСкладах.ДобавитьПриход();
	        Движение.Период        = Дата;
	        Движение.Склад         = Выборка.Склад;
	        Движение.Номенклатура  = Выборка.Номенклатура;
	        Движение.Количество    = Выборка.Количество;
	        Движение.Сумма         = Выборка.Сумма; 
			Движение.СрокГодности  = Дата('00010101');

	КонецЦикла;
КонецЕсли;
КонецПроцедуры

	
		
