
&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.СтатьяЗатрат = ПолучитьСтатьюЗатратПоНоменклатуре(СтрокаТЧ.Номенклатура);  
		
		СтрокаТЧ.цена = РаботаСЦенами.ПолучитьЦенуОтПоставщика(СтрокаТЧ.Номенклатура, Объект.Дата);  
		
		РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ); 
		
	КонецЕсли;   
	ОбновитьСуммуДокумента(); 
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	
КонецПроцедуры      

&НаСервереБезКонтекста                                      
Функция ПолучитьСтатьюЗатратПоНоменклатуре(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	Запрос.Текст=
	"ВЫБРАТЬ
	|    Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат
	|ИЗ
	|    Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|    Номенклатура.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	возврат Выборка.СтатьяЗатрат;
КонецФункции

&НаКлиенте
Процедура ОбновитьСуммуДокумента()
	СуммаДокумента = Объект.Услуги.Итог("Сумма"); 
	Объект.СуммаДокумента = СуммаДокумента ; 
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент) 
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры 

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)  
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	ОбновитьСуммуДокумента(); 
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ); 

	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	Для каждого СтрокаТЧ из Объект.Услуги Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуОтПоставщика(СтрокаТЧ.Номенклатура,Объект.Поставщик, Объект.Дата); 
		Иначе
			СтрокаТЧ.Цена = 0;
			
		КонецЕсли; 
		РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);

	КонецЦикла ;
	
	ОбновитьСуммуДокумента();
	
КонецПроцедуры





