
&НаСервере
Процедура ЗаполнитьРеквизитыФормы()
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипДенежныхСредств = Перечисления.ТипДенежныхСредств.Наличные;
		Объект.ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя;
	КонецЕсли;
	Плательщик = Объект.Плательщик;
	ВидОперации = Объект.ВидОперации;
	ТипДенежныхСредств = Объект.ТипДенежныхСредств;
	
	
	
КонецПроцедуры  
&НаКлиенте
Процедура УстановитьВидимость()   
	  СтрокаТипПлательщика = "";    
    Если Объект.ТипДенежныхСредств =  ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Наличные") Тогда
        Элементы.Касса.Видимость = Истина;
        Элементы.ЭквайринговыйТерминал.Видимость = Ложь;                                                         
	ИначеЕсли Объект.ТипДенежныхСредств =  ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Безналичные") Тогда
		Элементы.Касса.Видимость = Ложь;
		Элементы.ЭквайринговыйТерминал.Видимость = Истина;    
	КонецЕсли;
	
	Если Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника") Тогда 
		Элементы.КассаИсточник.Видимость = Ложь;
		Элементы.Касса.Заголовок = "Касса";
		
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.РасчетныйСчет.Видимость = Ложь;
		Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
		Элементы.Касса.Видимость = Истина;
		Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Наличные");
		Элементы.ТипДенежныхСредств.Доступность = Ложь;
		СтрокаТипПлательщика = "СправочникСсылка.Сотрудники";
	ИначеЕсли Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПолучениеНаличныхВБанке") Тогда
		Элементы.КассаИсточник.Видимость = Ложь;
		Элементы.Касса.Заголовок = "Касса";
		
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
		Элементы.Касса.Видимость = Истина;
		Элементы.РасчетныйСчет.Видимость = Истина;
		Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Наличные");
		Элементы.ТипДенежныхСредств.Доступность = Ложь;
		СтрокаТипПлательщика = "СправочникСсылка.Банки";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПоставщика") Тогда 
		Элементы.КассаИсточник.Видимость = Ложь;
		
		Элементы.Касса.Заголовок = "Касса";
		Элементы.ДоговорКонтрагента.Видимость = Истина;
		Элементы.Касса.Видимость = Истина;
		Элементы.РасчетныйСчет.Видимость = Ложь;
		Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
		Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Наличные");
		Элементы.ТипДенежныхСредств.Доступность = Ложь;
		СтрокаТипПлательщика = "СправочникСсылка.Контрагенты"; 
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПоступлениеИзДругойКассы") Тогда   
		Элементы.Касса.Заголовок = "Касса получатель";
		Элементы.Плательщик.Видимость = Ложь;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.РасчетныйСчет.Видимость = Ложь;
		Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
		Элементы.Касса.Видимость = Истина;
		Элементы.КассаИсточник.Видимость = Истина;
		Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Наличные");
		Элементы.ТипДенежныхСредств.Доступность = Ложь;                                                                              
		СтрокаТипПлательщика = "СправочникСсылка.Кассы";  		
	Иначе   
		Элементы.Касса.Заголовок = "Касса";
		Элементы.ДоговорКонтрагента.Видимость = Истина;         
		Элементы.Плательщик.Видимость = Истина;
		Элементы.ТипДенежныхСредств.Доступность = Истина;
		Элементы.РасчетныйСчет.Видимость = Ложь;
		СтрокаТипПлательщика = "СправочникСсылка.Контрагенты";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТипПлательщика) Тогда         
		Массив = Новый Массив();
		Массив.Добавить(Тип(СтрокаТипПлательщика));
		
		ОписаниеТипаПлательщика = Новый ОписаниеТипов(Массив);;
		Элементы.Плательщик.ОграничениеТипа = ОписаниеТипаПлательщика;        
	КонецЕсли;  
	Если Элементы.ДоговорКонтрагента.Видимость = Истина
		И ЗначениеЗаполнено(Объект.Плательщик) Тогда
		Элементы.ДоговорКонтрагента.Видимость = ПроверкаТипаКонтрагента.ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Плательщик);
    КонецЕсли;
  //      СтрокаТипПлательщика = "";
  //  Если Объект.ТипДенежныхСредств = ПредопределенноеЗначение(
  //  	"Перечисление.ТипДенежныхСредств.Наличные") Тогда
  //  	Элементы.Касса.Видимость = Истина;
  //  	Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
  //  ИначеЕсли Объект.ТипДенежныхСредств = ПредопределенноеЗначение(
  //  	"Перечисление.ТипДенежныхСредств.Безналичные") Тогда
  //  	Элементы.Касса.Видимость = Ложь;
  //  	Элементы.ЭквайринговыйТерминал.Видимость = Истина;
  //  КонецЕсли;
  //  
  //  
  //  Если Объект.ВидОперации = ПредопределенноеЗначение(
  //  	"Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника") Тогда
  //  	Элементы.ДоговорКонтрагента.Видимость = Ложь;
  //  	СтрокаТипПлательщика = "СправочникСсылка.Сотрудники";
  //  	
  //  ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение(
  //  	"Перечисление.ВидыОперацийПоступленияДенег.ПолучениеНаличныхВБанке") Тогда
  //  	Элементы.ДоговорКонтрагента.Видимость = Ложь;
  //  	СтрокаТипПлательщика = "СправочникСсылка.Банки";
  //  	
  //  Иначе
  //  	Элементы.ДоговорКонтрагента.Видимость = Истина;
  //  	СтрокаТипПлательщика = "СправочникСсылка.Контрагенты";
  //  КонецЕсли;
  //  
  //  МассивТипов = Новый Массив();
  //  МассивТипов.Добавить(Тип(СтрокаТипПлательщика));
  //  Элементы.Плательщик.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
  //  
  //  Если Элементы.ДоговорКонтрагента.Видимость = Истина
  //  	И СтрокаТипПлательщика = "СправочникСсылка.Контрагенты"
  //  	И ЗначениеЗаполнено(Объект.Плательщик) Тогда
  //  	
  //Элементы.ДоговорКонтрагента.Видимость = ПроверкаТипаКонтрагента.ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Плательщик);
  //  КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ТипДенежныхСредствПриИзменении(Элемент)
	МассивОчищаемыхРеквизитов = Новый Массив;
	
	Если Объект.ТипДенежныхСредств =  ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Наличные")
		И ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал) Тогда 
		МассивОчищаемыхРеквизитов.Добавить("ЭквайринговыйТерминал");
		ТекстВопроса = "При изменении реквизита ""Тип денежных средств"" будут очищены следующие данные:
		| - Эквайринговый терминал
		| Продолжить?";
		
	ИначеЕсли Объект.ТипДенежныхСредств =  ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Безналичные")
		И ЗначениеЗаполнено(Объект.Касса) Тогда 
		МассивОчищаемыхРеквизитов.Добавить("Касса");
		ТекстВопроса = "При изменении реквизита ""Тип денежных средств"" будут очищены следующие данные:
		| - Касса
		| Продолжить?";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда 
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииТипаДенежныхСредств", ЭтаФорма, МассивОчищаемыхРеквизитов); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!"); 
	Иначе
		ТипДенежныхСредств =  Объект.ТипДенежныхСредств;
		УстановитьВидимость(); 
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииТипаДенежныхСредств(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Для Каждого Реквизит Из ДополнительныеПараметры Цикл
			Объект[Реквизит] = Неопределено;
		КонецЦикла;
		
		ТипДенежныхСредств =  Объект.ТипДенежныхСредств; 
		УстановитьВидимость();
	Иначе
		Объект.ТипДенежныхСредств = ТипДенежныхСредств;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацийПриИзменении(Элемент)
	МассивОчищаемыхРеквизитов = Новый Массив; 
	Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПолучениеНаличныхВБанке"))
		И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");
		
		ТекстВопроса = "При изменении реквизита ""Вид операции"" будут очищены следующие данные:
		| - Договор
		| Продолжить?";
	КонецЕсли;
	Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииВидаОперации", ЭтаФорма, МассивОчищаемыхРеквизитов);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");
	Иначе 
		ВидОперации = Объект.ВидОперации;
		УстановитьВидимость();
	КонецЕсли;
	
	
КонецПроцедуры
&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииВидаОперации(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Для Каждого Реквизит Из ДополнительныеПараметры Цикл
			Объект[Реквизит] = Неопределено;
		КонецЦикла;
		ВидОперации =  Объект.ВидОперации; 
		УстановитьВидимость();
		
	Иначе
		Объект.ВидОперации = ВидОперации;  
		
	КонецЕсли; 
	
КонецПроцедуры
&НаКлиенте  

Процедура ПлательщикПриИзменении(Элемент) 
 Если Не ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Или Плательщик = Объект.Плательщик Тогда
        Плательщик = Объект.Плательщик;
        УстановитьВидимость();
        Возврат;
    КонецЕсли;
    
     ТипМеняется = Ложь;
    
    Если ТипЗнч(Плательщик) <> ТипЗнч(Объект.Плательщик) Тогда
        ТипМеняется = Истина;
    ИначеЕсли ТипЗнч(Плательщик) = Тип("СправочникСсылка.Контрагенты") Тогда
          СтараяВидимость = ПроверкаТипаКонтрагента.ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Плательщик);
        НоваяВидимость = ПроверкаТипаКонтрагента.ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Плательщик);
        Если СтараяВидимость <> НоваяВидимость Тогда
            ТипМеняется = Истина;
        КонецЕсли;
    КонецЕсли;
    
    Если ТипМеняется Тогда
     
        ТекстВопроса = "При изменении получателя договор будет очищен. Продолжить?";
        Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииПлательщик", ЭтаФорма, 
            Новый Структура("СтарыйПлательщик,НовыйПлательщик", Плательщик, Объект.Плательщик));
        ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , "Внимание!");
    Иначе
         Объект.ДоговорКонтрагента = Неопределено;
        Плательщик = Объект.Плательщик;
        УстановитьВидимость();
    КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииПлательщик(Результат, ДополнительныеПараметры) Экспорт 
	  Если Результат = КодВозвратаДиалога.Да Тогда
        Объект.ДоговорКонтрагента = Неопределено; 
		Плательщик = Объект.Плательщик;
        УстановитьВидимость();
	Иначе     
		Объект.Плательщик = ДополнительныеПараметры.СтарыйПлательщик;

           Плательщик = ДополнительныеПараметры.СтарыйПлательщик; 
		КонецЕсли
	КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры    

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Объект.Касса = Константы.ОсновнаяКасса.Получить();
	 Если Параметры.Свойство("Основание")
    И ЗначениеЗаполнено(Параметры.Основание)
    И ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда 
    СтруктураОплаты = Документы.РеализацияТоваровИУслуг.ПроверитьОплатуДокумента(Параметры.Основание);
    СтатусОплаты = СтруктураОплаты.СтатусОплаты;

    Если СтатусОплаты = Перечисления.ОплатаДокумента.ПолностьюОплачен Тогда
        СообщениеПользователю = Новый СообщениеПользователю();   
		
        СообщениеПользователю.Текст = "Данный документ уже полностью оплачен. Ввод дополнительного документа оплаты не требуется!";
        СообщениеПользователю.Сообщить();
        Отказ = Истина;
        возврат;
    Иначе
        Объект.СуммаДокумента = СтруктураОплаты.ОсталосьОплатить; 
		ОсталосьОплатить = СтруктураОплаты.ОсталосьОплатить;
	КонецЕсли;
КонецЕсли;
	ЗаполнитьРеквизитыФормы();

КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
    Если ОсталосьОплатить > 0 И Объект.СуммаДокумента > ОсталосьОплатить Тогда
        Объект.СуммаДокумента = ОсталосьОплатить;
    КонецЕсли;  
КонецПроцедуры





