
&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
		СтрокаТЧ.Сумма = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Услуга,,Объект.Дата);
	Иначе
		СтрокаТЧ.Сумма = 0;  
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Товар) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Товар,,Объект.Дата);
	Иначе
		СтрокаТЧ.Цена = 0;
	КонецЕсли;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);  
КонецПроцедуры



&НаКлиенте
Процедура ОбновитьСуммуДокумента()
	СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма"); 
	Объект.СуммаДокумента = СуммаДокумента ;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ОбновитьСуммуДокумента();	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	ОбновитьСуммуДокумента();	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ); 
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент) 
	Если НЕ ЗначениеЗаполнено(Объект.Основание)Тогда
		ПересчитатьЦеныПоДатеДокумента(); 
	КонецЕсли;
	ОбновитьСуммуДокумента();
КонецПроцедуры 
&НаКлиенте
Процедура ПересчитатьЦеныПоДатеДокумента()
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Товар) Тогда
			СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(
			СтрокаТЧ.Товар, , Объект.Дата);
			РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
			СтрокаТЧ.Сумма = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(
			СтрокаТЧ.Услуга, , Объект.Дата);
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
Если Объект.Ссылка.Пустая() Тогда
        Объект.СтатусОплаты = Перечисления.ОплатаДокумента.НеОплачен; 
	Иначе   
        Если Объект.СтатусОплаты <> Перечисления.ОплатаДокумента.ПолностьюОплачен Тогда
            СтруктураОплаты = Документы.РеализацияТоваровИУслуг.ПроверитьОплатуДокумента(Объект.Ссылка);
            Объект.СтатусОплаты = СтруктураОплаты.СтатусОплаты;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если Параметры.Свойство("Основание")
		И значениеЗаполнено(Параметры.Основание)
		и ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ЗаписьКлиента") Тогда 
		СуществующийДокумент = Документы.РеализацияТоваровИУслуг.ПроверитьЗапись(Параметры.Основание);
		Если СуществующийДокумент <> Неопределено Тогда
		СообщениеПользователю = Новый СообщениеПользователю();
		СообщениеПользователю.Текст = СтрШаблон("Для документа  уже введен документ реализации %1", СуществующийДокумент);
		СообщениеПользователю.Сообщить();
		Отказ = Истина;
		Возврат;
		КонецЕсли;
		КонецЕсли;
КонецПроцедуры



 
 
 