Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(АвторДокумента) Тогда
		АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры   

Процедура ОбработкаПроведения(Отказ, Режим)
	Если ВидОперации <> Перечисления.ВидыОперацийПоступленияДенег.ПоступлениеИзДругойКассы Тогда
	АналитикаПроводки = ПолучитьАналитикуПроводки();
	
	Движения.Хозрасчетный.Записывать = Истина;
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетДт = АналитикаПроводки.СчетДебета;
	Движение.СчетКт = АналитикаПроводки.СчетКредита;
	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	Движение.Содержание = АналитикаПроводки.СодержаниеОперации;
	БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, АналитикаПроводки.СубконтоДебет);
	БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, АналитикаПроводки.СубконтоКредит);
	КонецЕсли;
	
	
	Движения.ДенежныеСредства.Записывать = Истина;
	Движения.ДенежныеСредства.Записать();  
	
	Движения.БезналичнаяОплата.Записывать = Истина;
	Движения.БезналичнаяОплата.Записать();
	
	Если ТипДенежныхСредств =  Перечисления.ТипДенежныхСредств.Наличные Тогда
		
		Движение = Движения.ДенежныеСредства.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;                            
		Движение.Период = Дата;
		Движение.БанковскийСчетКасса = Касса;
		Движение.ТипДенежныхСредств = ТипДенежныхСредств;
		Движение.Сумма = СуммаДокумента;
		
	ИначеЕсли ТипДенежныхСредств =  Перечисления.ТипДенежныхСредств.Безналичные Тогда
		
		Движение = Движения.БезналичнаяОплата.Добавить();
		Движение.Период = Дата;
		Движение.ЭквайринговыйТерминал = ЭквайринговыйТерминал;
		Движение.Сумма = СуммаДокумента;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда 
		ДанныеДокументаОснования = ПолучитьДанныеПоОплатеПоРеализацииТоваров(ДанныеЗаполнения);       
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокументаОснования);
	КонецЕсли;  
КонецПроцедуры 

Функция ПолучитьДанныеПоОплатеПоРеализацииТоваров(ДанныеЗаполнения)  
	
	Запрос = Новый Запрос;  
	 Запрос.УстановитьПараметр("Ссылка",ДанныеЗаполнения);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровИУслуг.Клиент КАК Плательщик,
		|	РеализацияТоваровИУслуг.СуммаДокумента КАК СуммаДокумента,
		|	РеализацияТоваровИУслуг.Ссылка КАК ДокументОснование
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
		|ГДЕ
		|	РеализацияТоваровИУслуг.Ссылка = &Ссылка"; 
	
     Выборка = Запрос.Выполнить().Выбрать();
	 Выборка.Следующий();
	 Возврат Выборка;
 КонецФункции
 
 Функция ПолучитьАналитикуПроводки()
	 
	 ОплатаОтПокупателя = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя;
	 ВозвратОтПоставщика = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПоставщика;
	 ПолучениеНаличныхВБанке = Перечисления.ВидыОперацийПоступленияДенег.ПолучениеНаличныхВБанке;
	 ВозвратОтПодотчетника  = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника;    
	 ОплатаПоКарте = Перечисления.ТипДенежныхСредств.Безналичные;
	 
	 СтруктураАналитики = Новый Структура;
	 СтруктураАналитики.Вставить("СчетДебета", ПланыСчетов.Хозрасчетный.Касса);
	 СтруктураАналитики.Вставить("СубконтоДебет", Касса);
	 Если ВидОперации = ОплатаОтПокупателя Тогда
		 Если ТипДенежныхСредств = ОплатаПоКарте Тогда
			 СтруктураАналитики.Вставить("СчетДебета", ПланыСчетов.Хозрасчетный.ПереводыВПути);
			 СтруктураАналитики.Вставить("СубконтоДебет", ЭквайринговыйТерминал);
			 СтруктураАналитики.Вставить("СодержаниеОперации", "Оплата от покупателя банковской картой");
		 Иначе
			 СтруктураАналитики.Вставить("СодержаниеОперации", "Оплата от покупателя наличными в кассу");
		 КонецЕсли;
		 СтруктураАналитики.Вставить("СчетКредита", ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
		 СтруктураАналитики.Вставить("СубконтоКредит", Плательщик);
	 ИначеЕсли ВидОперации = ВозвратОтПоставщика Тогда
		 СтруктураАналитики.Вставить("СчетКредита", ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками);
		 СтруктураАналитики.Вставить("СодержаниеОперации", "Возврат от поставщика наличными в кассу");
		 СтруктураАналитики.Вставить("СубконтоКредит", Плательщик);
	 ИначеЕсли ВидОперации = ПолучениеНаличныхВБанке Тогда
		 СтруктураАналитики.Вставить("СчетКредита", ПланыСчетов.Хозрасчетный.РасчетныеСчета);
		 СтруктураАналитики.Вставить("СодержаниеОперации", "Получение наличных денег с расчетного счета в кассу");
		 СтруктураАналитики.Вставить("СубконтоКредит", РасчетныйСчет);
	 ИначеЕсли ВидОперации = ВозвратОтПодотчетника Тогда 
		 СтруктураАналитики.Вставить("СчетКредита", ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами);
		 СтруктураАналитики.Вставить("СодержаниеОперации", "Возврат подотчетных средств"); 
		 СтруктураАналитики.Вставить("СубконтоКредит", Плательщик);
	 КонецЕсли;
	 
	 Возврат СтруктураАналитики;
	 
 КонецФункции

 Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)   
	 
 Если ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ПоступлениеИзДругойКассы Тогда
        
        
        НовыйМассив = Новый Массив;
        
        Для Каждого Реквизит Из ПроверяемыеРеквизиты Цикл
            Если Реквизит <> "Плательщик" Тогда
                НовыйМассив.Добавить(Реквизит);
            КонецЕсли;
        КонецЦикла;
        
        
        ПроверяемыеРеквизиты.Очистить();
        Для Каждого Реквизит Из НовыйМассив Цикл
            ПроверяемыеРеквизиты.Добавить(Реквизит);
        КонецЦикла;
        
    КонецЕсли; 
КонецПроцедуры
 
 