Функция ПолучитьДанныеДляДиаграмм(ПериодОбработки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ПродажиОбороты.Клиент.Источник.Представление, ""не указан"") КАК ИсточникиИнформации,
		|	ПродажиОбороты.СуммаОборот КАК Количество
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ПродажиОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ПродажиОбороты.Клиент.Источник.Представление, ""не указан""),
		|	ПродажиОбороты.СуммаОборот
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Сумма,
		|	ПродажиОбороты.Сотрудник.Представление КАК Сотрудник
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.СуммаОборот <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Сотрудник.Представление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот
		|ПОМЕСТИТЬ ВТ_КонкретныеУслуги
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК ПродажиОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот
		|ПОМЕСТИТЬ ВТ_ВсеПродажи
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК ПродажиОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КонкретныеУслуги.Номенклатура КАК Номенклатура,
		|	ВТ_КонкретныеУслуги.СуммаОборот КАК СуммаПродажНоменклатуры,
		|	ВТ_ВсеПродажи.СуммаОборот КАК ОбщаяСуммаПоУслугам
		|ПОМЕСТИТЬ ВТ_Предытог
		|ИЗ
		|	ВТ_КонкретныеУслуги КАК ВТ_КонкретныеУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеПродажи КАК ВТ_ВсеПродажи
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА 100 * ВТ_Предытог.СуммаПродажНоменклатуры / ВТ_Предытог.ОбщаяСуммаПоУслугам > 10
		|			ТОГДА ВТ_Предытог.Номенклатура.Представление
		|		ИНАЧЕ ""Прочее""
		|	КОНЕЦ КАК Номенклатура,
		|	СУММА(ВТ_Предытог.СуммаПродажНоменклатуры) КАК Сумма
		|ИЗ
		|	ВТ_Предытог КАК ВТ_Предытог
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА 100 * ВТ_Предытог.СуммаПродажНоменклатуры / ВТ_Предытог.ОбщаяСуммаПоУслугам > 10
		|			ТОГДА ВТ_Предытог.Номенклатура.Представление
		|		ИНАЧЕ ""Прочее""
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодОбработки);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОбработки));
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	Возврат РезультатПакет;           
	
КонецФункции	
