Функция ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Плательщик, Получатель = Неопределено) Экспорт	
	

Запрос = Новый Запрос;
Запрос.УстановитьПараметр("Плательщик", Плательщик);
Запрос.Текст = "ВЫБРАТЬ
|    Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
|    Контрагенты.Ссылка КАК Контрагент
|ИЗ
|    Справочник.Контрагенты КАК Контрагенты
|ГДЕ
|    Контрагенты.Ссылка = &Плательщик";

Выборка = Запрос.Выполнить().Выбрать();
Выборка.Следующий();

Если ЗначениеЗаполнено(Выборка.ТипКонтрагента)
	И Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда
	возврат Ложь;
Иначе
	возврат Истина;
КонецЕсли;
КонецФункции 

фУНКЦИЯ НайтиПоставщика(Поставщик) Экспорт
	
Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЭтоГруппа = ЛОЖЬ
		|	И Контрагенты.ТипКонтрагента = &ТипКонтрагента";
	
		Запрос.УстановитьПараметр("ТипКонтрагента", Перечисления.ТипыКонтрагентов.Поставщик);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции
		
	