
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьВидимость()
	
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда  
		Элементы.Наименование.Заголовок = "ф.И.О. клиента";
		Элементы.ДатаРождения.Видимость = Истина;
		Элементы.Пол.Видимость = Истина;
		Элементы.Источник.Видимость = Истина;
		Элементы.ОсновнойДоговор.Видимость = Ложь;
		Элементы.Питомцы.Видимость = Истина; 
		
	Иначе   
		Элементы.Наименование.Заголовок = "Наименование";
		Элементы.ДатаРождения.Видимость = Ложь;
		Элементы.Пол.Видимость = Ложь;
		Элементы.Источник.Видимость = Ложь;
		Элементы.ОсновнойДоговор.Видимость = Истина;  
		Элементы.Питомцы.Видимость = Ложь;  
				КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость();    
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.Наименование.Заголовок ="Ф.И.О. клиента"
	Иначе
		Элементы.Наименование.Заголовок = "Наименование:";
		КонецЕсли;
КонецПроцедуры


