
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);  

КонецПроцедуры 


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ); 

КонецПроцедуры  

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент) 


СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
//Если ЗначениеЗаполнено(СтрокаТЧ.товар) Тогда
//	СтрокаТЧ.цена = РаботаСЦенами.ПолучитьЦенуОтПоставщика(СтрокаТЧ.Товар,Объект.Поставщик,Объект.Дата);
//Иначе
//	СтрокаТЧ.Цена = 0;
//КонецЕсли;
РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
ОбновитьСуммуДокумента();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСуммуДокумента()
	СуммаДокумента = Объект.Товары.Итог("Сумма"); 
	Объект.СуммаДокумента = СуммаДокумента
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;     
	Если ЗначениеЗаполнено(СтрокаТЧ.товар) Тогда  
	СтрокаТЧ.цена = РаботаСЦенами.ПолучитьЦенуОтПоставщика(СтрокаТЧ.товар,Объект.Поставщик, Объект.Дата);
Иначе
	СтрокаТЧ.цена = 0; 
КонецЕсли;
РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	
		
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьЦены(Команда)
	Для каждого СтрокаТЧ из Объект.Товары Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.товар) Тогда
			СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуОтПоставщика(СтрокаТЧ.Товар,Объект.Поставщик, Объект.Дата);
		Иначе
			СтрокаТЧ.цена = 0;
			КонецЕсли;
				 РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
		
	КонецЦикла  ;

	ОбновитьСуммуДокумента();
КонецПроцедуры

