  
  &НаКлиенте
  
  Процедура УстановитьВидимость()
	  
	  Если Объект.ПризнакБессрочногоДоговора Тогда //1
		  
		  Элементы.ДатаОкончанияДоговора.Видимость = Ложь;
		  
		  Если ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) Тогда //2
			  
			  Объект.ДатаОкончанияДоговора = '0001,01,01';
			  
		  КонецЕсли;
		  
	  Иначе
		  
		  Элементы.ДатаОкончанияДоговора.Видимость = Истина;
		  
	  КонецЕсли;
	  
  КонецПроцедуры
  
  &НаКлиенте
  Процедура СформироватьНаименованиеДоговора()
	  Если ЗначениеЗаполнено(объект.ВнешнийНомерДоговора)
		  И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		  Объект.Наименование = "№ " + Объект.ВнешнийНомерДоговора + " от " + формат(Объект.ДатаЗаключенияДоговора,"ДФ=dd.MM.yyyy");
	  ИначеЕсли ЗначениеЗаполнено(Объект.ВнешнийНомерДоговора)
		  И НЕ ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		  Объект.Наименование = "№ " + Объект.ВнешнийНомерДоговора;
	  Иначе
		  Объект.Наименование = "" + Формат(Объект.ДатаЗаключенияДоговора,"ДФ=dd.MM.yyyy");
	  КонецЕсли;
  КонецПроцедуры
  
  
  &НаКлиенте
  Процедура ПриОткрытии(Отказ)
	  УстановитьВидимость();
	  Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда 
		  СформироватьНаименованиеДоговора();
	  КонецЕсли;
  КонецПроцедуры  
  
  
  
  &НаКлиенте
  Процедура ПризнакБессрочногоДоговораПриИзменении(Элемент)
	  УстановитьВидимость();
  КонецПроцедуры
  
  &НаКлиенте
  Процедура ВнешнийНомерДоговораПриИзменении(Элемент)
	  СформироватьНаименованиеДоговора()
  КонецПроцедуры
  
  &НаКлиенте
  Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	  СформироватьНаименованиеДоговора()
  КонецПроцедуры
  
  
  
  
  
  
  
  