
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)  
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	РеализацияТоваровИУслуг.Основание = &Основание" ;
	
	Запрос.УстановитьПараметр("Основание", ДанныеЗаполнения);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Выборка.Следующий();      
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Для записи клиента уже создан документ реализации %1", Выборка.Ссылка);
		Сообщение.Сообщить();
		ВызватьИсключение СтрШаблон("Для документа уже введён документ реализации %1!", выборка.Ссылка);  
			КонецЕсли  ;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаписьКлиента") Тогда
		Клиент = ДанныеЗаполнения.Клиент;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаУслуга Из ДанныеЗаполнения.Услуга Цикл
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Сумма = ТекСтрокаУслуга.Стоимость;
			НоваяСтрока.Услуга = ТекСтрокаУслуга.Услуга;
		КонецЦикла;
	КонецЕсли;
	Ответственный = ПараметрыСеанса.ТекущийПользователь; 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ТоварыНаСкладах.Записывать = Истина;  
	Движения.Продажи.Записывать = Истина;  
	Движения.ЗаказыКлиентов.Записывать = Истина;  
	Движения.УчетЗатрат.Записывать = Истина; 
	Движения.Хозрасчетный.Записывать = Истина;
	
  Движения.ТоварыНаСкладах.Записать();    
   Движения.Продажи.Записать();    
   Движения.УчетЗатрат.Записать();
   Движения.Хозрасчетный.Записать(); 
   Движения.ЗаказыКлиентов.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный; 
	ЭлементБлокировки.ИсточникДанных = Товары; 
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Товар"); 
	ЭлементБлокировки.УстановитьЗначение("Склад",  Склад);
	Блокировка.Заблокировать(); 
	ЗапретПроведения = Константы.ЗапретПроведенияПриОтрицательныхОстатках.Получить();
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслугТовары.Товар КАК Номенклатура,
	|	СУММА(РеализацияТоваровИУслугТовары.Количество) КАК Количество,
	|	СУММА(РеализацияТоваровИУслугТовары.Сумма) КАК Сумма,
	|	&Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТоваровИУслугТовары
	|ГДЕ
	|	РеализацияТоваровИУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслугТовары.Товар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровИУслугУслуги.Услуга,
	|	СУММА(1),
	|	СУММА(РеализацияТоваровИУслугУслуги.Сумма),
	|	&Склад
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Услуги КАК РеализацияТоваровИУслугУслуги
	|ГДЕ
	|	РеализацияТоваровИУслугУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслугУслуги.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Количество КАК КоличествоВДокументе,
	|	ВТ_Номенклатура.Сумма КАК СуммаВДокументе,
	|	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ВЫБОР
	|		КОГДА ВТ_Номенклатура.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоТовар,
	|	ВТ_Номенклатура.Номенклатура.СтатьяЗатрат КАК НоменклатураСтатьяЗатрат,
	|	ВТ_Номенклатура.Склад КАК Склад,
	|	ВТ_Номенклатура.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ВТ_Номенклатура.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МоментВремени,
	|				(Номенклатура, Склад) В
	|					(ВЫБРАТЬ
	|						ВТ_Номенклатура.Номенклатура,
	|						ВТ_Номенклатура.Склад
	|					ИЗ
	|						ВТ_Номенклатура КАК ВТ_Номенклатура)) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ_Номенклатура.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВТ_Номенклатура.Склад = ТоварыНаСкладахОстатки.Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	СрокГодности
	|ИТОГИ
	|	МАКСИМУМ(КоличествоВДокументе),
	|	МАКСИМУМ(СуммаВДокументе),
	|	СУММА(КоличествоОстаток),
	|	СУММА(СуммаОстаток)
	|ПО
	|	НоменклатураСтатьяЗатрат,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	ВыборкаНоменклатураСтатьяЗатрат = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	Пока ВыборкаНоменклатураСтатьяЗатрат.Следующий() Цикл  
		СуммаЗатрат = 0;
		
		ВыборкаНоменклатура = ВыборкаНоменклатураСтатьяЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл  
			
			Если ВыборкаНоменклатура.ЭтоТовар Тогда
				
				Превышение = ВыборкаНоменклатура.КоличествоВДокументе - ВыборкаНоменклатура.КоличествоОстаток; 
				Если Превышение > 0 Тогда 
					Сообщение = Новый СообщениеПользователю; 
					Если ЗапретПроведения Тогда
						Отказ = Истина;
						Сообщение.Текст = СтрШаблон("Проведение запрещено. Отсутствуют остатки по номенклатуре ""%1"" в количестве ""%2""", ВыборкаНоменклатура.НоменклатураПредставление, Превышение); 
						Сообщение.Сообщить();
						Продолжить;
					Иначе
						Сообщение.Текст =СтрШаблон("В результате проводки документа образовались отрицательные остатки. Превышение остатка по номенклатуре ""%1"" в количестве ""%2""", ВыборкаНоменклатура.НоменклатураПредставление, Превышение);
						Сообщение.Сообщить();
					КонецЕсли;
				КонецЕсли;
				
				
				ОсталосьСписать = ВыборкаНоменклатура.КоличествоВДокументе;
				
				ВыборкаДетальные = ВыборкаНоменклатура.Выбрать();  
				
				Пока ВыборкаДетальные.Следующий()И ОсталосьСписать > 0 Цикл  
					Если ВыборкаДетальные.КоличествоОстаток <=0 Тогда
						Продолжить;
					КонецЕсли;
					Списываем = Мин(ВыборкаДетальные.КоличествоОстаток, ОсталосьСписать);
					Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
					Движение.Период = Дата;
					Движение.Номенклатура = ВыборкаДетальные.Номенклатура;
					Движение.Склад = ВыборкаДетальные.Склад;
					Движение.СрокГодности = ВыборкаДетальные.СрокГодности;
					Движение.Количество = Списываем;
					Если Списываем = ВыборкаДетальные.КоличествоОстаток Тогда  
						СуммаСписания = ВыборкаДетальные.СуммаОстаток;
						//Движение.Сумма = ВыборкаДетальные.СуммаОстаток;
					Иначе
						СуммаСписания = Списываем / ВыборкаДетальные.КоличествоОстаток * ВыборкаДетальные.СуммаОстаток;
					КонецЕсли;
					Движение.Сумма = СуммаСписания;
					
					ОсталосьСписать = ОсталосьСписать - Списываем; 
					СуммаЗатрат = СуммаЗатрат + Движение.Сумма; 
					
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.СчетДт = ПланыСчетов.Хозрасчетный.Продажи;
				Движение.СчетКт = ВыборкаНоменклатура.СчетБухгалтерскогоУчета;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ВыборкаДетальные.Номенклатура; 
				Движение.Период    = Дата;    
				Движение.Сумма = СуммаСписания;
				Движение.Содержание    = "Списана себестоимость товарно-материальных ценностей";
					
				КонецЦикла; 
				Если ОсталосьСписать > 0 Тогда
					Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
					Движение.Период = Дата;
					Движение.Номенклатура = ВыборкаНоменклатура.номенклатура;
					Движение.Склад = Склад;
					Движение.СрокГодности = Неопределено;
					Движение.Количество = ОсталосьСписать;
					Движение.Сумма = 0;
				КонецЕсли;
				
			КонецЕсли ; 
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаНоменклатура.Номенклатура;
			Движение.Сотрудник = Сотрудник;
			Движение.Клиент = Клиент;
			Движение.Сумма = ВыборкаНоменклатура.СуммаВДокументе;
			
			
		КонецЦикла;   
		Если СуммаЗатрат > 0 Тогда
			Движение = Движения.УчетЗатрат.Добавить();
			Движение.Период = Дата;
			Движение.СтатьяЗатрат = ВыборкаНоменклатураСтатьяЗатрат.НоменклатураСтатьяЗатрат;
			Движение.Сумма = СуммаЗатрат;
		КонецЕсли;
	КонецЦикла;
	//Проводка по отражению выручки Дт62 Кт90
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.Продажи;
	БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Клиент);
	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	Движение.Содержание = "Отражена выручка от реализации товаров и услуг";   
	
	Если ЗначениеЗаполнено(Основание) Тогда	
		Движение = Движения.ЗаказыКлиентов.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.ЗаписьКлиента = Основание;
		Движение.СуммаФакт = Услуги.Итог("Сумма") 
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма"); 
	
	Если ЗначениеЗаполнено(Ссылка)
		И СтатусОплаты <> Перечисления.ОплатаДокумента.ПолностьюОплачен Тогда
		СтруктураОплаты = Документы.РеализацияТоваровИУслуг.ПроверитьОплатуДокумента(Ссылка);
		СтатусОплаты = СтруктураОплаты.СтатусОплаты;
	КонецЕсли;
КонецПроцедуры    

Процедура ПриЗаписи(Отказ)
	Если ЗначениеЗаполнено(Основание) Тогда
		ЗаписьОбъект = Основание.ПолучитьОбъект();
		ЗаписьОбъект.УслугаОказана = Истина;
		ЗаписьОбъект.Записать();
	КонецЕсли;
КонецПроцедуры








