
&НаКлиенте                                       
Процедура ЗаполнитьСписокСотрудников(Команда)                  
	ПолучитьДанныеОСотрудника()  
КонецПроцедуры    


&НаСервере
Процедура ПолучитьДанныеОСотрудника();     
	
		НачалоМесяца = НачалоМесяца(Объект.ПериодНачисления);
	КонецМесяца = КонецМесяца(Объект.ПериодНачисления); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	КадроваяИсторияСотрудниковСрезПоследних.Оклад КАК Оклад,
	|	КадроваяИсторияСотрудниковСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	|	КадроваяИсторияСотрудниковСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ДатаНачала, Работает = ИСТИНА) КАК КадроваяИсторияСотрудниковСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КадроваяИсторияСотрудников.Сотрудник,
	|	КадроваяИсторияСотрудников.Оклад,
	|	КадроваяИсторияСотрудников.ГрафикРаботы,
	|	КадроваяИсторияСотрудников.Период
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
	|ГДЕ
	|	КадроваяИсторияСотрудников.Работает = ИСТИНА
	|	И КадроваяИсторияСотрудников.Период МЕЖДУ &ДатаНачала И &ДатаОкончания"  ;
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Начисления.Добавить();
		
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ПоказательРасчета = Выборка.Оклад;
		НоваяСтрока.ДатаНачала = НачалоМесяца;
		НоваяСтрока.ДатаОкончания = КонецМесяца;
	КонецЦикла;
	
	
КонецПроцедуры       
