
&НаКлиенте
Процедура УслугаУслугаПриИзменении(Элемент)
	  СтрокаТЧ = Элементы.Услуга.ТекущиеДанные;
  Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
	  СтрокаТЧ.Стоимость = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Услуга,,Объект.Дата);
  Иначе
	  СтрокаТЧ.Стоимость = 0;
  КонецЕсли;
  

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если Объект.Ссылка.Пустая() Тогда

Если Параметры.Свойство("Начало") Тогда 
Объект.ДатаЗаписи = Параметры.Начало;
КонецЕсли;

Если Параметры.Свойство("Окончание") Тогда
Объект.ДатаОкончанияЗаписи = Параметры.Окончание;
КонецЕсли;

Если Параметры.Свойство("Сотрудник") Тогда
Объект.Сотрудник = Параметры.Сотрудник;
КонецЕсли;

Если ЗначениеЗаполнено(Объект.ДатаЗаписи) Тогда
Объект.Дата = НачалоДня(Объект.ДатаЗаписи);
КонецЕсли;    

КонецЕсли;  


УстановитьДоступностьЭлементовФормы();
КонецПроцедуры   
&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
    Если РольДоступна("ПолныеПрава") Тогда
        Элементы.УслугаОказана.ТолькоПросмотр = Ложь;
    КонецЕсли;        
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	  Оповестить("Записан заказ");
  КонецПроцедуры 

