
Процедура ОбработкаПроведения(Отказ, Режим)  
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
	
	
	СтруктураУчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата);
	Если СтруктураУчетнаяПолитика.УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.FEFO Тогда
		ОтражатьСрокиГодности = Истина;
	Иначе
		ОтражатьСрокиГодности = Ложь;
	КонецЕсли;                
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровТовары.Товар КАК Номенклатура,
	|	СУММА(ПоступлениеТоваровТовары.Количество) КАК Количество,
	|	СУММА(ПоступлениеТоваровТовары.Сумма) КАК Сумма,
	|	ПоступлениеТоваровТовары.СрокГодности КАК СрокГодности,
	|	ПоступлениеТоваровТовары.Товар.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	|ГДЕ
	|	ПоступлениеТоваровТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровТовары.Товар,
	|	ПоступлениеТоваровТовары.СрокГодности,
	|	ПоступлениеТоваровТовары.Товар.СчетБухгалтерскогоУчета";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл // (5)
		Движение = Движения.ТоварыНаСкладах.Добавить(); //(6)
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Сумма = Выборка.Сумма;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
		Если ОтражатьСрокиГодности Тогда //(7)
			Движение.СрокГодности = Выборка.СрокГодности;
		КонецЕсли; 
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.СчетДт = Выборка.СчетБухгалтерскогоУчета;
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
		Движение.Период = Дата;
		Движение.Сумма = Выборка.Сумма;
		Движение.Содержание = "Отражено поступление товарно-материальных ценностей от поставщика";
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = Выборка.Номенклатура;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты] = Поставщик;
		
		
	КонецЦикла; 
	
	КонецПроцедуры
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	//ЗаполнитьСрокиГодности();
	СуммаДокумента = Товары.Итог("Сумма"); 
	Ответственный = ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

//Процедура ЗаполнитьСрокиГодности() 
//	СекундВОдномДне = 24 * 60 * 60;	
//	Для каждого СтрокаТЧ из Товары Цикл
//		Если ЗначениеЗаполнено(СтрокаТЧ.СрокГодности) Тогда
//			Продолжить;
//		КонецЕсли;
//		СтрокаТЧ.СрокГодности = Дата + СтрокаТЧ.Товар.СрокГодности * СекундВОдномДне;	
//	КонецЦикла;	
//КонецПроцедуры

